In [10]:
import pandas as pd
import numpy as np

from Code.UtilityFunctions.get_data_path import get_path
from Code.UtilityFunctions.run_query import run_query
from Code.UtilityFunctions.dictionary_functions import flatten_dictionary

___
___
___
# **DO NOT RUN ALL LINES BELOW. SOME YELP ENTITIES ARE VERY LARGE, AND YOU MIGHT RUN OUT OF RAM.**

In [4]:
business = pd.read_json(get_path("yelp_academic_dataset_business.json"), lines=True)
business['categories'] = business['categories'].str.split(', ', expand=False)

In [3]:
users = pd.read_json(get_path("yelp_academic_dataset_user.json"), lines=True)

In [2]:
reviews = pd.read_json(get_path("yelp_academic_dataset_review.json"), lines=True)
#reviews = pd.merge(left=reviews, right=business, how='left', left_on='business_id', right_on='business_id')
#reviews = pd.merge(left=reviews, right=users, how='left', left_on='user_id', right_on='user_id')

In [4]:
reviews.head(10)

,review_id,user_id,business_id,stars_x,useful,funny,cool,text,date,name,...,state,postal_code,latitude,longitude,stars_y,review_count,is_open,attributes,categories,hours
0,KU_O5udG6zpxOg-VcAEodg,mh_-eMZ6K5RLWhZyISBhwA,XQfwVwDr-v0ZS3_CbbE5Xw,3,0,0,0,"If you decide to eat here, just be aware it is...",2018-07-07 22:09:11,Turning Point of North Wales,...,PA,19454,40.210196,-75.223639,3.0,169,1,"{'NoiseLevel': 'u'average'', 'HasTV': 'False',...","[Restaurants, Breakfast & Brunch, Food, Juice ...","{'Monday': '7:30-15:0', 'Tuesday': '7:30-15:0'..."
1,BiTunyQ73aT9WBnpR9DZGw,OyoGAe7OKpv6SyGZT5g77Q,7ATYjTIgM3jUlt4UM3IypQ,5,1,0,1,I've taken a lot of spin classes over the year...,2012-01-03 15:28:18,Body Cycle Spinning Studio,...,PA,19119,39.952103,-75.172753,5.0,144,0,"{'BusinessAcceptsCreditCards': 'True', 'GoodFo...","[Active Life, Cycling Classes, Trainers, Gyms,...","{'Monday': '6:30-20:30', 'Tuesday': '6:30-20:3..."
2,saUsX_uimxRlCVr67Z4Jig,8g_iMtfSiwikVnbP2etR0A,YjUWPpI6HXG530lwP-fb2A,3,0,0,0,Family diner. Had the buffet. Eclectic assortm...,2014-02-05 20:30:30,Kettle Restaurant,...,AZ,85713,32.207233,-110.980864,3.5,47,1,"{'RestaurantsReservations': 'True', 'BusinessP...","[Restaurants, Breakfast & Brunch]",None
3,AqPFMleE6RsU23_auESxiA,_7bHUi9Uuf5__HHc_Q8guQ,kxX2SOes4o-D3ZQBkiMRfA,5,1,0,1,"Wow! Yummy, different, delicious. Our favo...",2015-01-04 00:01:03,Zaika,...,PA,19114,40.079848,-75.025080,4.0,181,1,"{'Caters': 'True', 'Ambience': '{'romantic': F...","[Halal, Pakistani, Restaurants, Indian]","{'Tuesday': '11:0-21:0', 'Wednesday': '11:0-21..."
4,Sx8TMOWLNuJBWer-0pcmoA,bcjbaE6dDog4jkNY91ncLQ,e4Vwtrqf-wpJfwesgvdgxQ,4,1,0,1,Cute interior and owner (?) gave us tour of up...,2017-01-14 20:54:15,Melt,...,LA,70119,29.962102,-90.087958,4.0,32,0,"{'BusinessParking': '{'garage': False, 'street...","[Sandwiches, Beer, Wine & Spirits, Bars, Food,...","{'Monday': '0:0-0:0', 'Friday': '11:0-17:0', '..."
5,JrIxlS1TzJ-iCu79ul40cQ,eUta8W_HdHMXPzLBBZhL1A,04UD14gamNjLY0IDYVhHJg,1,1,2,1,I am a long term frequent customer of this est...,2015-09-23 23:10:31,Dmitri's,...,PA,19147,39.938013,-75.148131,4.0,273,0,"{'BusinessParking': '{'garage': False, 'street...","[Mediterranean, Restaurants, Seafood, Greek]","{'Wednesday': '17:30-21:0', 'Thursday': '17:30..."
6,6AxgBCNX_PNTOxmbRSwcKQ,r3zeYsv1XFBRA4dJpL78cw,gmjsEdUsKpj9Xxu6pdjH0g,5,0,2,0,Loved this tour! I grabbed a groupon and the p...,2015-01-03 23:21:18,The Voodoo Bone Lady Tours,...,LA,70170,29.952030,-90.070334,4.5,359,1,{'GoodForKids': 'True'},"[Supernatural Readings, Tours, Hotels & Travel...","{'Monday': '10:0-22:0', 'Tuesday': '10:0-22:0'..."
7,_ZeMknuYdlQcUqng_Im3yg,yfFzsLmaWF2d4Sr0UNbBgg,LHSTtnW3YHCeUkRDGyJOyw,5,2,0,0,Amazingly amazing wings and homemade bleu chee...,2015-08-07 02:29:16,Fries Rebellion,...,PA,18951,40.407537,-75.338825,3.5,103,0,"{'RestaurantsAttire': ''casual'', 'Ambience': ...","[Beer Bar, Bars, American (New), Gastropubs, R...","{'Wednesday': '11:0-23:0', 'Thursday': '11:0-2..."
8,ZKvDG2sBvHVdF5oBNUOpAQ,wSTuiTk-sKNdcFyprzZAjg,B5XSoSG3SfvQGtKEGQ1tSQ,3,1,1,0,This easter instead of going to Lopez Lake we ...,2016-03-30 22:46:33,Los Padres National Forest,...,CA,93105,34.597239,-119.510772,4.5,13,1,"{'GoodForKids': 'True', 'BikeParking': 'True',...","[Parks, Active Life]",None
9,pUycOfUwM8vqX7KjRRhUEA,59MxRhNVhU9MYndMkz0wtw,gebiRewfieSdtt17PTW6Zg,3,0,0,0,Had a party of 6 here for hibachi. Our waitres...,2016-07-25 07:31:06,Hibachi Steak House & Sushi Bar,...,CA,93101,34.416984,-119.695556,3.5,488,1,"{'Corkage': 'False', 'RestaurantsTakeOut': 'Tr...","[Steakhouses, Sushi Bars, Restaurants, Japanese]",{'Monday': '0:0-0:0'}

In [ ]:
checkins = pd.read_json(get_path("yelp_academic_dataset_checkin.json"), lines=True)
checkins['date'] = checkins['date'].str.split(', ', expand=False)
checkins = checkins.explode('date')

In [3]:
tips = pd.read_json(get_path("yelp_academic_dataset_tip.json"), lines=True)

___
___
___
### How many different types of businesses are defined in Yelp?

In [2]:
sparql_query ="""

SELECT COUNT(DISTINCT(?category))
WHERE {
    ?business schema:category ?category .
}

"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.value
0            1311

In [5]:
unique_categories = {category for sublist in business['categories'] if sublist for category in sublist}
len(unique_categories)

1311

### How many businesses of type "Restaurants" exist?

In [3]:
sparql_query = """

SELECT COUNT(DISTINCT(?business)) AS ?numberRestaurants
WHERE {
    ?business schema:category yelpcat:Restaurants .
}

"""

run_query(query=sparql_query, as_dataframe=True)

  numberRestaurants.value
0                   52268

In [7]:
counter = 0
for row in business['categories']:
    if row is not None and "Restaurants" in row:
        counter += 1
print(counter)

52268

### How many businesses of type Restaurants have been reviewed?

In [5]:
sparql_query = """

SELECT ?business
WHERE {
    ?review schema:about ?business .
}

"""

run_query(query=sparql_query, as_dataframe=True)

                                        business.value
0      https://www.yelp.com/biz/jAYRTHKmUxNhpbycdjoGwg
1      https://www.yelp.com/biz/J2Jl-zmU7bjKsc9JZ65c-Q
2      https://www.yelp.com/biz/yLIn3po-fKb0T3UIoJdiyQ
3      https://www.yelp.com/biz/sf-KdXHB5nxfNjl2uUpI6Q
4      https://www.yelp.com/biz/yjcIKn2T2QY_DjXWACsAFw
...                                                ...
99995  https://www.yelp.com/biz/r6dvcGaTEcvN4nUIeS15nA
99996  https://www.yelp.com/biz/xsIKentPBt136G5rWpHK0A
99997  https://www.yelp.com/biz/VYkEik6T-yVY-jRK28mF3A
99998  https://www.yelp.com/biz/93atrWOjLwaRuuaaiiEYZw
99999  https://www.yelp.com/biz/hOupS2QRNIuMLfcpOqC0oA

[100000 rows x 1 columns]

In [3]:
sparql_query = """

SELECT ?business
WHERE {
    ?business schema:category yelpcat:Restaurants .
}

"""

run_query(query=sparql_query, as_dataframe=True)

                                          business.value
0      https://purl.archive.org/purl/yelp/yelp_entiti...
1      https://purl.archive.org/purl/yelp/yelp_entiti...
2      https://purl.archive.org/purl/yelp/yelp_entiti...
3      https://purl.archive.org/purl/yelp/yelp_entiti...
4      https://purl.archive.org/purl/yelp/yelp_entiti...
...                                                  ...
52263  https://purl.archive.org/purl/yelp/yelp_entiti...
52264  https://purl.archive.org/purl/yelp/yelp_entiti...
52265  https://purl.archive.org/purl/yelp/yelp_entiti...
52266  https://purl.archive.org/purl/yelp/yelp_entiti...
52267  https://purl.archive.org/purl/yelp/yelp_entiti...

[52268 rows x 1 columns]

In [7]:
review_unique_business = reviews.drop_duplicates(subset=['business_id'])
mask = review_unique_business['categories'].apply(lambda x: x is not None and "Restaurants" in x)
len(review_unique_business[mask])

52268

### How many businesses have been reviewed?

In [7]:
sparql_query = """

SELECT COUNT(DISTINCT(?business))
WHERE {
    ?review schema:about ?business .
    ?review rdfs:Class schema:UserReview .
}

"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.value
0          150346

In [32]:
review_unique_business = reviews.drop_duplicates(subset=['business_id'])
len(review_unique_business)

150346

### How many businesses have, on average, a rating of 4.5?

In [23]:
sparql_query = """
SELECT COUNT(DISTINCT(?business))
WHERE {
    ?business schema:aggregateRating ?rating .
    FILTER (?rating = 4.5) .
}

"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.value
0           27181

In [49]:
business[business['stars'] == 4.5].groupby('stars')['stars'].count()

stars
4.5    27181
Name: stars, dtype: int64

### What is the average rating across businesses?

In [11]:
sparql_query = """
SELECT AVG(?rating) as ?averagerating
WHERE {
    ?business schema:aggregateRating ?rating .
}

"""

run_query(query=sparql_query, as_dataframe=True)

,averagerating.type,averagerating.datatype,averagerating.value
0,typed-literal,http://www.w3.org/2001/XMLSchema#decimal,3.59672355766033

In [25]:
business['stars'].mean()

3.5967235576603303

### How many businesses have been reviewed in Santa Barbara, CA?

TO DO: RUN AGAIN

In [5]:
sparql_query = """
SELECT ?state ?city COUNT(?business) AS ?count_business
WHERE {
    ?business rdfs:Class schema:LocalBusiness .
    ?business schema:location ?city .
    ?city rdfs:label ?city_name .
    ?city yelpont:location ?state .
    VALUES ?city_name{'Santa Barbara'} .
}
GROUP BY ?state ?city
ORDER BY DESC(?count_business)
LIMIT 10

"""

run_query(query=sparql_query, as_dataframe=True)

Empty resultset

Empty DataFrame
Columns: []
Index: []

In [31]:
business_santa_barbara = business[business['city'] == "Santa Barbara"]
len(business_santa_barbara)

3829

### What are the five most busy days, and for what business?

In [25]:
sparql_query = """
SELECT ?business ?year ?month ?day COUNT(?visit) as ?numberOfVisits
WHERE {
    ?business schema:checkinTime ?visit .
    BIND (day(?visit)  as ?day)
    BIND (month(?visit) as ?month)
    BIND (year(?visit) as ?year)
}
GROUP BY ?business ?year ?month ?day
ORDER BY DESC(COUNT(?visit))
LIMIT 5

"""

run_query(query=sparql_query, as_dataframe=True)

,business.value,year.value,month.value,day.value,numberOfVisits.value
0,https://purl.archive.org/purl/yelp/yelp_entiti...,2016,6,25,457
1,https://purl.archive.org/purl/yelp/yelp_entiti...,2015,8,30,285
2,https://purl.archive.org/purl/yelp/yelp_entiti...,2016,8,28,268
3,https://purl.archive.org/purl/yelp/yelp_entiti...,2016,8,28,263
4,https://purl.archive.org/purl/yelp/yelp_entiti...,2017,7,29,251

In [17]:
checkins["Day"] = checkins["date"].apply(lambda x: x.split("-")[2][:2])
checkins["Month"] = checkins["date"].apply(lambda x: x.split("-")[1])
checkins["Year"] = checkins["date"].apply(lambda x: x.split("-")[0])

checkins.value_counts(subset=["business_id", "Day", "Month", "Year"], sort=True, ascending=False).head(5)

business_id             Day  Month  Year
CySqUcNz8oPiQTu4EXTnig  25   06     2016    465
g50ImmCX3WY3koEDIzoKxg  30   08     2015    287
qfWWx0dVo1UuAhRfh03Dyw  28   08     2016    270
g50ImmCX3WY3koEDIzoKxg  28   08     2016    264
FBBeJO50xZiNIo3oFhAFRA  29   07     2017    254
dtype: int64

### Which are the top 10 most visisted businesses?

In [52]:
sparql_query = """
SELECT ?business COUNT(?visit) AS ?count_visits
WHERE {
    ?business schema:checkinTime ?visit .
}
GROUP BY ?business 
ORDER BY DESC(COUNT(?visit))
LIMIT 10

"""

run_query(query=sparql_query, as_dataframe=True)

                                      business.value count_visits.value
0  https://purl.archive.org/purl/yelp/yelp_entiti...              52129
1  https://purl.archive.org/purl/yelp/yelp_entiti...              40092
2  https://purl.archive.org/purl/yelp/yelp_entiti...              37553
3  https://purl.archive.org/purl/yelp/yelp_entiti...              37511
4  https://purl.archive.org/purl/yelp/yelp_entiti...              31163
5  https://purl.archive.org/purl/yelp/yelp_entiti...              29599
6  https://purl.archive.org/purl/yelp/yelp_entiti...              28917
7  https://purl.archive.org/purl/yelp/yelp_entiti...              21527
8  https://purl.archive.org/purl/yelp/yelp_entiti...              21478
9  https://purl.archive.org/purl/yelp/yelp_entiti...              18604

In [20]:
checkins.value_counts(subset=["business_id"], sort=True, ascending=False).head(10)

business_id
-QI8Qi8XWH3D8y8ethnajA    52144
FEXhWNCMkv22qG04E83Qjg    40109
Eb1XmmLWyt_way5NNZ7-Pw    37562
c_4c5rJECZSfNgFj7frwHQ    37518
4i4kmYm9wgSNyF1b6gKphg    31168
8O35ji_yOMVJmZ6bl96yhQ    29606
VQcCL9PiNL_wkGf-uF3fjg    28927
ac1AeYqs8Z4_e2X5M3if2A    21542
QTbahs-GVuWYL5yfdjH34A    21487
ytynqOUb3hjKeJfRj5Tshw    18615
dtype: int64

### How many people have written a review or tip on Yelp?
TO DO: Not correct result, may be because reviews DF can contain "..." reviews which are NOT added to the KG.

In [63]:
sparql_query = """
SELECT COUNT(DISTINCT(?user)) AS ?countUsers
WHERE {
    ?user rdfs:Class schema:Person .
    ?review schema:author ?user .
}
"""

run_query(query=sparql_query, as_dataframe=True)

  count_users.value
0           1987897

In [7]:
reviews.drop_duplicates(subset=['user_id']).shape[0]

1987929

### How many users have 10 friends?

In [5]:
sparql_query = """
SELECT COUNT(*) as ?usersWith10Friends
WHERE {
    SELECT ?user COUNT(?friend) AS ?countUsers
    WHERE {
        ?user rdfs:Class schema:Person .
        ?user schema:knows ?friend .
    }
    GROUP BY ?user
    HAVING (COUNT(?friend) = 10)
}
"""

run_query(query=sparql_query, as_dataframe=True)

  callret-0.value
0           13579

In [11]:
users["amountFriends"] = users["friends"].apply(lambda x: len(x.split(",")))
users[users["amountFriends"] == 10].shape[0]

13579

### How many friends does a user have on average?
TO DO: Is not giving correct result

In [73]:
sparql_query = """
SELECT AVG(?numberOfFriends) as ?averageFriends
WHERE { 
    SELECT COUNT(?friend) as ?numberOfFriends
    WHERE {
        ?user rdfs:Class schema:Person .
        ?user schema:knows ?friend .
    }
    GROUP BY ?user
}
"""

run_query(query=sparql_query, as_dataframe=True)

  averageFriends.value
0   94.853611046508483

In [ ]:
sparql_query = """
SELECT (?numberOfFriends / ?numberOfUsers) as ?averageFriends
WHERE {
    SELECT COUNT(?friend) as ?numberOfFriends 
    WHERE {
        ?user rdfs:Class schema:Person .
        ?user schema:knows ?friend .
    }
    SELECT COUNT(?user) as ?numberOfUsers
    WHERE {
        ?user rdfs:Class schema:Person .
    }
}
"""

run_query(query=sparql_query, as_dataframe=True)

In [26]:
sparql_query = """
SELECT ?numberOfFriends ?numberOfUsers
WHERE {
    SELECT COUNT(?friend) as ?numberOfFriends COUNT(?user) as ?numberOfUsers
    WHERE {
        ?user rdfs:Class schema:Person .
        ?user schema:knows ?friend .
        }
}
"""

run_query(query=sparql_query, as_dataframe=True)

  numberOfFriends.value numberOfUsers.value
0             105225474           105225474

In [12]:
# How many friends does a user have on average?
users["amountFriends"].mean()

53.375011381374385

### How many users have authored 10 reviews?

In [84]:
sparql_query = """
SELECT COUNT(DISTINCT(?user)) AS ?countUsers
WHERE {
    SELECT ?user COUNT(?review) as ?numberOfReviews
    WHERE {
        ?user rdfs:Class schema:Person .
        ?review schema:author ?user .
    }
    GROUP BY ?user
    HAVING (COUNT(?review) = 10)
}
"""

run_query(query=sparql_query, as_dataframe=True)

  countUsers.value
0            14119

In [17]:
# Count how many users have authored 10 reviews
reviews.groupby("user_id").size().reset_index(name="count").query("count == 10").shape[0]

14119

### How many reviews did users make in May 2018?

In [12]:
sparql_query = """
SELECT ?year ?month COUNT(?review) as ?countReviews
WHERE {
    ?review rdfs:Class schema:UserReview .
    ?review schema:dateCreated ?date .
    BIND (month(?date) as ?month) .
    BIND (year(?date) as ?year) .
    VALUES ?year {2018}
    VALUES ?month {5}
}
GROUP BY ?year ?month
"""

run_query(query=sparql_query, as_dataframe=True)

  year.value month.value countReviews.value
0       2018           5              79434

In [3]:
reviews['YEAR'] = reviews.date.dt.year
reviews['MONTH'] = reviews.date.dt.month
reviews.query("YEAR == 2018 & MONTH == 5").shape[0]

79434